Python 3.12.0 (v3.12.0:0fb18b02c8, Oct  2 2023, 09:45:56) [Clang 13.0.0 (clang-1300.0.29.30)] on darwin
Type "help", "copyright", "credits" or "license()" for more information.
def land(width,long) :
    cal = width * long
    cal_wa = cal / 4
    print('ที่ดินผืนนี้กว้าง: {} เมตร ยาว: {} เมตร' .format(width,long))
    print('ที่ดินผืนนี้มีพื้นที่: {} ตารางเมตร ' .format(cal))
    print('ที่ดินผืนนี้มีพื้นที่: {} ตารางวา ' .format(cal_wa))

    
land(5,15)
ที่ดินผืนนี้กว้าง: 5 เมตร ยาว: 15 เมตร
ที่ดินผืนนี้มีพื้นที่: 75 ตารางเมตร 
ที่ดินผืนนี้มีพื้นที่: 18.75 ตารางวา 
land(10,80)
ที่ดินผืนนี้กว้าง: 10 เมตร ยาว: 80 เมตร
ที่ดินผืนนี้มีพื้นที่: 800 ตารางเมตร 
ที่ดินผืนนี้มีพื้นที่: 200.0 ตารางวา 
res = land(5,15)
ที่ดินผืนนี้กว้าง: 5 เมตร ยาว: 15 เมตร
ที่ดินผืนนี้มีพื้นที่: 75 ตารางเมตร 
ที่ดินผืนนี้มีพื้นที่: 18.75 ตารางวา 
print(res)
None

def land(width,long) :
    cal = width * long
    cal_wa = cal / 4
    print('ที่ดินผืนนี้กว้าง: {} เมตร ยาว: {} เมตร' .format(width,long))
    print('ที่ดินผืนนี้มีพื้นที่: {} ตารางเมตร ' .format(cal))
    print('ที่ดินผืนนี้มีพื้นที่: {} ตารางวา ' .format(cal_wa))
    return cal_wa

res = land(5,15)
ที่ดินผืนนี้กว้าง: 5 เมตร ยาว: 15 เมตร
ที่ดินผืนนี้มีพื้นที่: 75 ตารางเมตร 
ที่ดินผืนนี้มีพื้นที่: 18.75 ตารางวา 
print(res)
SyntaxError: multiple statements found while compiling a single statement
res = land(5,15)
ที่ดินผืนนี้กว้าง: 5 เมตร ยาว: 15 เมตร
ที่ดินผืนนี้มีพื้นที่: 75 ตารางเมตร 
ที่ดินผืนนี้มีพื้นที่: 18.75 ตารางวา 
>>> print(res)
18.75
>>> 
>>> def land(width,long,price = 999888) :
...     cal = width * long
...     cal_wa = cal / 4
...     print('ที่ดินผืนนี้กว้าง: {} เมตร ยาว: {} เมตร' .format(width,long))
...     print('ที่ดินผืนนี้มีพื้นที่: {} ตารางเมตร ' .format(cal))
...     print('ที่ดินผืนนี้มีพื้นที่: {} ตารางวา ' .format(cal_wa))
...     return cal_wa * price
... 
>>> res = land(5,15)
ที่ดินผืนนี้กว้าง: 5 เมตร ยาว: 15 เมตร
ที่ดินผืนนี้มีพื้นที่: 75 ตารางเมตร 
ที่ดินผืนนี้มีพื้นที่: 18.75 ตารางวา 
>>> print(res)
18747900.0
>>> 
>>> def land(width,long,price = 999888) :
...     cal = width * long
...     cal_wa = cal / 4
...     print('ที่ดินผืนนี้กว้าง: {} เมตร ยาว: {} เมตร' .format(width,long))
...     print('ที่ดินผืนนี้มีพื้นที่: {} ตารางเมตร ' .format(cal))
...     print('ที่ดินผืนนี้มีพื้นที่: {} ตารางวา ' .format(cal_wa))
...     calprice = cal_wa * price
...     return 'ที่ดินผืนนี้ราคา: {:,.2f} บาท'.format(calprice)
... 
>>> res= land(5,15)
ที่ดินผืนนี้กว้าง: 5 เมตร ยาว: 15 เมตร
ที่ดินผืนนี้มีพื้นที่: 75 ตารางเมตร 
ที่ดินผืนนี้มีพื้นที่: 18.75 ตารางวา 
>>> print(res)
ที่ดินผืนนี้ราคา: 18,747,900.00 บาท
>>> 
>>> land(5,15)
ที่ดินผืนนี้กว้าง: 5 เมตร ยาว: 15 เมตร
ที่ดินผืนนี้มีพื้นที่: 75 ตารางเมตร 
ที่ดินผืนนี้มีพื้นที่: 18.75 ตารางวา 
'ที่ดินผืนนี้ราคา: 18,747,900.00 บาท'
